
/* Edit Action Strings for HITextView / MLTE */

kTXNActionCut = "Cut";
kTXNActionPaste = "Paste";
kTXNActionClear = "Clear";
kTXNActionChangeFont = "Font Change";
kTXNActionChangeColor = "Color Change";
kTXNActionChangeSize = "Size Change";
kTXNActionChangeStyle = "Style Change";
kTXNActionAlignLeft = "Align Left";
kTXNActionAlignCenter = "Align Center";
kTXNActionAlignRight = "Align Right";
kTXNActionDrop = "Drop";
kTXNActionMove = "Move";
kTXNActionChangeFontFeature = "Font Feature Change";
kTXNActionChangeFontVariation = "Font Varitation Change";
kTXNActionChangeGlyphVariation = "Glyph Varitation Change";
kTXNActionChangeTextPosition = "Text Position Change";
kTXNActionUndoLast = "Last Action";

/* HITextView task descriptive message */

TaskDefault = "Welcome to MLTEShowcase!!!";
TaskSpellcheck = "Spell Checking enabled.  Try control clicking inside the HITextView";
TaskFontPanel = "Font Panel support enabled.  Use the Font Panel to set typographic style in the HITextView";
TaskActionGroup = "A number of edit actions have been performed as an action group.  Use the undo command with the HITextView to undo and redo all the actions as a group";
TaskAutoscroll = "Scrolling behavior set to kAutoScrollInsertionIntoView.";
TaskAutoscrollNever = "Scrolling behavior set to kAutoScrollNever.";
TaskAutoscrollIfVisible = "Scrolling behavior set to kAutoScollWhenInsertionVisible.";
TaskAutoscrollUnknown = "Scrolling behavior set to an unknown state...";
TaskReadCFURL = "A file was chosen and read into HITextView";
TaskReadCFURLError = "A file was chosen but an error occurred while trying to read it into the HITextView.";
TaskWriteCFURL = "The contents of the HITextView were written to a file.";
TaskWriteCFURLERROR = "An error occured while trying to write the contents of the HITextView to a file";
SpellcheckON = "Auto Spellcheck was turned on.";
SpellcheckOFF = "Auto Spellcheck was turned off.";
SpellSupportEnable = "Spelling support enabled.";
SpellSupportDisable = "Spelling support disabled.";
FontPanelEnable = "Font panel support enabled.";
FontPanelDisable = "Font panel support disabled.";
ActionGroupBEGIN = "An action group begin command was issued.  Edit actions will be grouped as a single undoable action until and action group end command is issued or an undo/redo command is executed.";
ActionGroupEND = "An action group end command was issued.";